Enums/ВидыНалоговВзносовОтчислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыНалоговВзносовОтчислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОППВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООСМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОПВР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ХарактерВыплатыЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ХарактерВыплатыЗарплаты</Name>
			<Comment>АПК:58 имя сохранено для обратной совместимости</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Межрасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ПодробнееОРасчетеНалогаВзносаОтчисления/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем СтарыеЗначенияКонтролируемыхПолей;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	МесяцНачисления = Параметры.МесяцНачисления;
	ВидНалогаВзносаОтчисления = Параметры.ДополнительныеПараметрыНВО.ВидНалогаВзносаОтчисления;
	ЭтоКонфигурацияЗарплатногоУчета = ЗарплатаКадрыРКПовтИсп.ЭтоКонфигурацияЗарплатногоУчета();
	ЭтоЮридическоеЛицо = ЗарплатаКадрыПовтИсп.ЭтоЮридическоеЛицо(Организация);
	ДокументСсылка = Параметры.Объект.Ссылка;
	// для УПК доходы субъекта предпринимательства для ТОО
	ВозможностьРасчетаКПН = ЭтоЮридическоеЛицо И НЕ ЭтоКонфигурацияЗарплатногоУчета;
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН И МесяцНачисления >= Дата(2026, 1, 1) Тогда
		Элементы.СправкаОРасчетахСФизическимЛицом.Видимость = Истина
	КонецЕсли;
	
	Если ВозможностьРасчетаКПН И Параметры.Свойство("Объект") Тогда
		
		Если НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.РегистрацияПрочихДоходов") Тогда
			ВозможностьРасчетаКПН = Ложь;	
		КонецЕсли;
	
	КонецЕсли;
	
	ПараметрВычетыИПН = ?(Параметры.Свойство("ВычетыИПН"), Параметры.ВычетыИПН, Неопределено);	
	ПараметрКомпонентыЕП = ?(Параметры.Свойство("КомпонентыЕП"), Параметры.КомпонентыЕП, Неопределено);	
	ПараметрДоходыНеПодлежащиеНалогообложению = ?(Параметры.Свойство("ДоходыНеПодлежащиеНалогообложению"), Параметры.ДоходыНеПодлежащиеНалогообложению, Неопределено);
	ПараметрФизическоеЛицо = ?(Параметры.ДополнительныеПараметрыНВО.Свойство("ФизическоеЛицо"), Параметры.ДополнительныеПараметрыНВО.ФизическоеЛицо, Неопределено);
	
	ЗаполнитьФизическоеЛицо(ПараметрФизическоеЛицо);
	ЗаполнитьФормуНаСервере(Параметры.НалогиВзносыОтчисления, ПараметрВычетыИПН, ПараметрДоходыНеПодлежащиеНалогообложению, ПараметрКомпонентыЕП, Истина, Параметры.ДополнительныеПараметрыНВО);
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВ Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ОПВ'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ВОСМС Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ВОСМС'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СН Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'СН'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.СО Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'СО'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ООСМС Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ООСМС'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОППВ Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ОППВ'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ОПВР Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ОПВР'");
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ЕП'");
		Заголовок = НСтр("ru = 'Подробнее о расчете суммы единого платежа'");
	ИначеЕсли ВозможностьРасчетаКПН Тогда
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ИПН (КПН)'");
	Иначе
		Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'ИПН'");
	КонецЕсли;	
	
	ТекстЗаголовка = НСтр("ru = 'Подробнее о расчете суммы %1: %2'");

	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда 
		
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, НСтр("ru = 'единого платежа'"), ФизическоеЛицо);	
		
		ПорядокВыплатыИмя = Параметры.ОписаниеДокумента.ПорядокВыплатыИмя;
		
		Если ЗначениеЗаполнено(ПорядокВыплатыИмя) Тогда
			
			Если НЕ Параметры.Объект[ПорядокВыплатыИмя] = Перечисления.ХарактерВыплатыЗарплаты.Зарплата
				И НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.Увольнение")
				И НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.УвольнениеСписком") Тогда
				Элементы.КомпонентыЕП.Видимость = Ложь;
				Элементы.НадписьМежрасчетныйДокумент.Видимость = Истина;
				Элементы.НадписьМежрасчетныйДокумент.Видимость = Истина;
				Элементы.НадписьМежрасчетныйДокумент.Заголовок = НСтр("ru = 'В документе произведен расчет суммы ЕП за счет работника. Распределение компонент единого платежа и расчет суммы ЕП за счет работодателя происходит в документах окончательного расчета.'");
				Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок = НСтр("ru = 'Сумма ЕП (за счет работника)'");
				Элементы.НадписьМежрасчетныйДокумент.ЦветТекста = ЦветаСтиля.ЦветОсобогоТекста;
				ТолькоПросмотр = Истина;
			КонецЕсли;
			
		КонецЕсли;
			
	Иначе
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗаголовка, Элементы.НалогиВзносыОтчисленияНалогВзнос.Заголовок, ФизическоеЛицо);	
		Элементы.НалогиВзносыОтчисленияОтключитьВопросы.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьНастройкиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Удалить("ОтключитьВопросКонтрольНВО");
	
	Настройки.Вставить("ОтключитьВопросКонтрольНВО", ОтключитьВопросы);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтключитьВопросКонтрольНВО = Настройки.Получить("ОтключитьВопросКонтрольНВО");
	
	Если ОтключитьВопросКонтрольНВО = Неопределено Тогда
		ОтключитьВопросы = Ложь;
		Возврат
	КонецЕсли;
	
	ОтключитьВопросы = ОтключитьВопросКонтрольНВО;
	Элементы.НалогиВзносыОтчисленияОтключитьВопросы.Пометка = ОтключитьВопросы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыНалогиВзносыОтчисления

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ФиксСтрока = Истина;
		ТекущиеДанные.ФиксРасчет = Истина;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления));
	Элементы.ВычетыИПН.ОтборСтрок = Отбор;
	Элементы.КомпонентыЕП.ОтборСтрок = Отбор;
	
	Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ФизическоеЛицо", ТекущиеДанные.ФизическоеЛицо));
	Элементы.ДоходыНеПодлежащиеНалогообложению.ОтборСтрок = Отбор;
	
	ПерессчитатьИтогиЕП(ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления);
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если Копирование Тогда
	
		ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления = 0;
		
	ИначеЕсли НоваяСтрока Тогда	
		
		ЗаполнитьНовуюСтроку();
		
	КонецЕсли;
	
	//РасчетЗарплатыКлиент.СтрокаРасчетаПриНачалеРедактирования(ЭтаФорма, "НалогиВзносыОтчисления", ТекущиеДанные, НоваяСтрока, Копирование);
	УчетНалоговВзносовОтчисленийРасширенныйКлиентСервер.НазначитьИдентификаторСтрокеНалогиВзносыОтчисления(ТекущиеДанные, МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления, НоваяСтрока);
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		Отбор = Новый ФиксированнаяСтруктура(Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления));
		Элементы.ВычетыИПН.ОтборСтрок = Отбор;
		Элементы.КомпонентыЕП.ОтборСтрок = Отбор;
	
		ПерессчитатьИтогиЕП(ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	//РасчетЗарплатыКлиент.СтрокаРасчетаПриОкончанииРедактирования(
	//	ЭтаФорма, УчетНДФЛКлиентСервер.ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыНДФЛ(), Ложь, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ИдентификаторУдаляемойСтрокиСтрокиНалогиВзносыОтчисления = ТекущиеДанные.ИдентификаторСтрокиНалогиВзносыОтчисления;
	
КонецПроцедуры

&НаКлиенте
Процедура НалогиВзносыОтчисленияПослеУдаления(Элемент)
	
	УдалитьВычетыИПН(ЭтаФорма, ИдентификаторУдаляемойСтрокиСтрокиНалогиВзносыОтчисления);
	УдалитьКомпонентыЕП(ЭтаФорма, ИдентификаторУдаляемойСтрокиСтрокиНалогиВзносыОтчисления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыВычетыИПН

&НаКлиенте
Процедура ВычетыИПНПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ВычетыИПН.ТекущиеДанные;
	ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ФиксСтрока = Истина;
        ТекущиеДанные.ФиксРасчет = Истина;
        ТекущиеДанныеНалогаВзносаОтчисления.ФиксСтрока = Истина;
        ТекущиеДанныеНалогаВзносаОтчисления.ФиксРасчет = Истина;
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыИПНПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
	Если ТекущиеДанныеНалогаВзносаОтчисления = Неопределено Тогда
		
		ВызватьИсключение  НСтр("ru='Не выбрана основная строка начисления ИПН, к которой применяются вычеты'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВычетыИПНПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеВычетыИПН = Элементы.ВычетыИПН.ТекущиеДанные;
		
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
		Если НЕ ТекущиеДанныеНалогаВзносаОтчисления = Неопределено
			И НЕ ТекущиеДанныеВычетыИПН = Неопределено Тогда
			
			ТекущиеДанныеВычетыИПН.ИдентификаторСтрокиНалогиВзносыОтчисления = ТекущиеДанныеНалогаВзносаОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		Если НЕ ТекущиеДанныеВычетыИПН = Неопределено Тогда
			ТекущиеДанныеВычетыИПН.ФиксСтрока = Истина;
			ТекущиеДанныеВычетыИПН.ФиксРасчет = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыДоходыНеПодлежащиеНалогообложению

&НаКлиенте
Процедура ДоходыНеПодлежащиеНалогообложениюПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДоходыНеПодлежащиеНалогообложению.ТекущиеДанные;
	ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;

	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ФиксСтрока = Истина;
        ТекущиеДанные.ФиксРасчет = Истина;
        Если НЕ ТекущиеДанныеНалогаВзносаОтчисления = Неопределено Тогда
            ТекущиеДанныеНалогаВзносаОтчисления.ФиксСтрока = Истина;
            ТекущиеДанныеНалогаВзносаОтчисления.ФиксРасчет = Истина;
        КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоходыНеПодлежащиеНалогообложениюПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанныеДоходыНеПодлежащиеНалогообложению = Элементы.ДоходыНеПодлежащиеНалогообложению.ТекущиеДанные;
		ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
		Если НЕ ТекущиеДанныеНалогаВзносаОтчисления = Неопределено
			И НЕ ТекущиеДанныеДоходыНеПодлежащиеНалогообложению = Неопределено Тогда
			
			ЗаполнитьЗначенияСвойств(ТекущиеДанныеДоходыНеПодлежащиеНалогообложению, ТекущиеДанныеНалогаВзносаОтчисления);
			
		Иначе
			
			ТекущиеДанныеДоходыНеПодлежащиеНалогообложению.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
			ТекущиеДанныеДоходыНеПодлежащиеНалогообложению.МесяцНалоговогоПериода = МесяцНачисления;
			ТекущиеДанныеДоходыНеПодлежащиеНалогообложению.ФизическоеЛицо = ФизическоеЛицо;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыКомпонентыЕП

&НаКлиенте
Процедура КомпонентыЕППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.КомпонентыЕП.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		ИтогоЗаСчетРаботника = ТекущиеДанные.ОПВ + ТекущиеДанные.ИПН + ТекущиеДанные.ВОСМС;
		ИтогоЗаСчетРаботодателя = ТекущиеДанные.СО + ТекущиеДанные.ОПВР + ТекущиеДанные.ООСМС;
	
		ТекущиеДанные.ФиксСтрока = Истина;
        ТекущиеДанные.ФиксРасчет = Истина;
		
	Иначе
		
		ИтогоЗаСчетРаботника = 0;
		ИтогоЗаСчетРаботодателя = 0;
		
	КонецЕсли;
	
	ТекущиеДанныеНВО = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
	
	Если НЕ ТекущиеДанныеНВО = Неопределено
		И НЕ ТекущиеДанныеНВО.ФиксСтрока Тогда
		
		ТекущиеДанныеНВО.ФиксСтрока = Истина;
        ТекущиеДанныеНВО.ФиксРасчет = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентыЕППередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
	Если ТекущиеДанныеНалогаВзносаОтчисления = Неопределено Тогда
		
		ВызватьИсключение  НСтр("ru='Не выбрана основная строка начисления ЕП, к которой применяются вычеты'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомпонентыЕППриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеКомпонентыЕП = Элементы.КомпонентыЕП.ТекущиеДанные;
		
	Если НоваяСтрока И НЕ Копирование Тогда
		
		ТекущиеДанныеНалогаВзносаОтчисления = Элементы.НалогиВзносыОтчисления.ТекущиеДанные;
		
		Если НЕ ТекущиеДанныеНалогаВзносаОтчисления = Неопределено
			И НЕ ТекущиеДанныеКомпонентыЕП = Неопределено Тогда
			
			ТекущиеДанныеКомпонентыЕП.ИдентификаторСтрокиНалогиВзносыОтчисления = ТекущиеДанныеНалогаВзносаОтчисления.ИдентификаторСтрокиНалогиВзносыОтчисления;
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если НоваяСтрока ИЛИ Копирование Тогда
		
		Если НЕ ТекущиеДанныеКомпонентыЕП = Неопределено Тогда
			ТекущиеДанныеКомпонентыЕП.ФиксСтрока = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНастройкиФормы()
	
	ДатаКонтроля = '2018-01-01';
	ДатаИспользованияКорректировки = '2019-01-01';
	ДатаУменьшенияОблагаемогоДохода = '2021-01-01';
	ДатаПрогрессивнойШкалыИПН2026 = '2026-01-01';

	ВидимостьВычетов = МесяцНачисления >= ДатаКонтроля;
	ВидимостьКорректировкиДохода = МесяцНачисления >= ДатаИспользованияКорректировки И МесяцНачисления < ДатаПрогрессивнойШкалыИПН2026;
	ВидимостьУменьшениеОблагаемогоДохода = МесяцНачисления >= ДатаУменьшенияОблагаемогоДохода И МесяцНачисления < ДатаПрогрессивнойШкалыИПН2026;
	ВидимостьПрогрессивнойШкалыИПН2026 = МесяцНачисления >= ДатаПрогрессивнойШкалыИПН2026;
	
	ВозможностьРедактированияНалоговВзносовОтчислений = НЕ ТолькоПросмотр;
	
	ЭтоИПН = (ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН);
	ЭтоЕП = (ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП);
	
	Элементы.НалогиВзносыОтчисленияРазрешенныйВычет.Видимость  = ЭтоИПН И НЕ ВидимостьВычетов;
	Элементы.НалогиВзносыОтчисленияПримененныйВычет.Видимость  = ЭтоИПН И НЕ ВидимостьВычетов;
	Элементы.НалогиВзносыОтчисленияПримененнаяЛьгота.Видимость = ЭтоИПН И (НЕ ВидимостьВычетов ИЛИ ВидимостьКорректировкиДохода ИЛИ ВидимостьУменьшениеОблагаемогоДохода);
	Элементы.НалогиВзносыОтчисленияНалогВзносСПревышения.Видимость = ЭтоИПН И ВидимостьПрогрессивнойШкалыИПН2026;
	Элементы.ГруппаВычетыИПН.Видимость = ЭтоИПН И ВидимостьВычетов;
	Элементы.ГруппаЕП.Видимость = ЭтоЕП ИЛИ КомпонентыЕП.Количество() > 0;
    ПорядокВыплатыИмя = Параметры.ОписаниеДокумента.ПорядокВыплатыИмя;
    Если Параметры.Объект.Свойство(ПорядокВыплатыИмя) 
        И НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.НачислениеПоДоговорам")
        И НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.Увольнение")
        И НЕ ТипЗнч(Параметры.Объект.Ссылка) = Тип("ДокументСсылка.УвольнениеСписком")Тогда
        Элементы.НалогиВзносыОтчисленияВидДохода.Доступность = Параметры.Объект[ПорядокВыплатыИмя] = Перечисления.ХарактерВыплатыЗарплаты.Зарплата;
    КонецЕсли;
    
	СтрокиНеоблагаемыхДоходовПоФизическомуЛицу = ДоходыНеПодлежащиеНалогообложению.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	 
	ЕстьНеоблагаемыеДоходыПоФизическомуЛица = СтрокиНеоблагаемыхДоходовПоФизическомуЛицу.Количество() > 0;
	
	Элементы.ГруппаДоходыНеПодлежащиеНалогообложению.Видимость = ЕстьНеоблагаемыеДоходыПоФизическомуЛица;
	
	Если НЕ Элементы.ГруппаДоходыНеПодлежащиеНалогообложению.Видимость
		И НЕ Элементы.ГруппаЕП.Видимость Тогда
		Элементы.ОбщаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;	
	КонецЕсли;
	
	Элементы.ГруппаКнопокПросмотр.Видимость			= НЕ ВозможностьРедактированияНалоговВзносовОтчислений;
	Элементы.ГруппаКнопокРедактирование.Видимость	= ВозможностьРедактированияНалоговВзносовОтчислений;
	Если ВозможностьРедактированияНалоговВзносовОтчислений Тогда
		Элементы.ФормаОК.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуНаСервере(Знач СведенияНалогиВзносыОтчисления, Знач СведенияВычетыИПН, Знач СведенияДоходыНеПодлежащиеНалогообложению, Знач СведенияКомпонентыЕП, Знач ПервичноеЗаполнение, Знач ДополнительныеПараметрыНВО)
	
	ТабличныеЧастиНалогиВзносыОтчисления = ПолучитьИзВременногоХранилища(СведенияНалогиВзносыОтчисления);
	ТабличныеЧастиНалогиВзносыОтчисления.Свойство("АдресРаспределенияРезультатовВХранилище", АдресРаспределенияРезультатовВХранилище);
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
		
		ТабличныеЧастиВычетыИПН = ПолучитьИзВременногоХранилища(СведенияВычетыИПН);
		
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП Тогда
		
		Если НЕ СведенияКомпонентыЕП = Неопределено Тогда
			ТабличныеЧастиКомпонентыЕП = ПолучитьИзВременногоХранилища(СведенияКомпонентыЕП);
		КонецЕсли;
		
	КонецЕсли; 
	
	ТабличныеЧастиДоходыНеПодлежащиеНалогообложению = ПолучитьИзВременногоХранилища(СведенияДоходыНеПодлежащиеНалогообложению);

	Если ТолькоПросмотр И ТабличныеЧастиНалогиВзносыОтчисления.НалогиВзносыОтчисления.Количество() = 0 Тогда
		
		ВызватьИсключение  НСтр("ru='Нет сведений о расчете налогов, взносов и отчислений'");
		
	КонецЕсли; 

	Если ПервичноеЗаполнение Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НалогиВзносыОтчисленияФизическоеЛицо",
			"ПараметрыВыбора",
			Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ПараметрВыбора("Отбор.Ссылка", ФизическоеЛицо))));
		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
			Элементы,
			"НалогиВзносыОтчисленияПодразделение",
			"ПараметрыВыбора",
			Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Новый ПараметрВыбора("Отбор.Владелец", Организация))));
		
		Элементы.НалогиВзносыОтчисления.ТекущаяСтрока	= 0;
		
		Если ТолькоПросмотр Тогда
			
			Элементы.НалогиВзносыОтчисления.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.НалогиВзносыОтчисления.ИзменятьСоставСтрок = Ложь;
			
			Элементы.ВычетыИПН.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.ВычетыИПН.ИзменятьСоставСтрок = Ложь;
			
			Элементы.ДоходыНеПодлежащиеНалогообложению.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.ДоходыНеПодлежащиеНалогообложению.ИзменятьСоставСтрок = Ложь;
			
			Элементы.КомпонентыЕП.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
			Элементы.КомпонентыЕП.ИзменятьСоставСтрок = Ложь;
			
		КонецЕсли;
			
	КонецЕсли; 
	
	// Инициализация табличных частей
	НалогиВзносыОтчисления.Загрузить(ТабличныеЧастиНалогиВзносыОтчисления.НалогиВзносыОтчисления);
	
	Если ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ИПН Тогда
		ВычетыИПН.Загрузить(ТабличныеЧастиВычетыИПН.ВычетыИПН);
	ИначеЕсли ВидНалогаВзносаОтчисления = Перечисления.ВидыНалоговВзносовОтчислений.ЕП
		И НЕ СведенияКомпонентыЕП = Неопределено Тогда	
		КомпонентыЕП.Загрузить(ТабличныеЧастиКомпонентыЕП.КомпонентыЕП);
	КонецЕсли; 
	
	ДоходыНеПодлежащиеНалогообложению.Загрузить(ТабличныеЧастиДоходыНеПодлежащиеНалогообложению.ДоходыНеПодлежащиеНалогообложению);
	
	Элементы.НалогиВзносыОтчисления.ОтборСтрок = Новый ФиксированнаяСтруктура("ФизическоеЛицо", ФизическоеЛицо);
	Элементы.ДоходыНеПодлежащиеНалогообложению.ОтборСтрок = Новый ФиксированнаяСтруктура("ФизическоеЛицо, ВидНалогаВзносаОтчисления", ФизическоеЛицо, ВидНалогаВзносаОтчисления);
	
	МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления = УчетНалоговВзносовОтчислений.МаксимальныйИдентификаторСтрокиНалогиВзносыОтчисления(НалогиВзносыОтчисления);
	
	Если ДополнительныеПараметрыНВО.Свойство("ВидДохода") И ДополнительныеПараметрыНВО.Свойство("Подразделение") Тогда
		ТекущийИндекс = 0;
		ВидДохода = ДополнительныеПараметрыНВО.ВидДохода;
		Подразделение = ДополнительныеПараметрыНВО.Подразделение;
		
		Для Каждого Стр Из НалогиВзносыОтчисления Цикл
			Если Стр.ВидДохода = ВидДохода 
				И Стр.ФизическоеЛицо = ФизическоеЛицо 
				И Стр.Подразделение = Подразделение Тогда
		        Прервать;                                                      	
		    КонецЕсли;
		    ТекущийИндекс = ТекущийИндекс + 1;
		КонецЦикла;

		Элементы.НалогиВзносыОтчисления.ТекущаяСтрока = ТекущийИндекс;
	ИначеЕсли ДополнительныеПараметрыНВО.Свойство("Подразделение") Тогда
		ТекущийИндекс = 0;
		Подразделение = ДополнительныеПараметрыНВО.Подразделение;
		
		Для Каждого Стр Из НалогиВзносыОтчисления Цикл
			Если Стр.Подразделение = Подразделение Тогда 
		        Прервать;                                                      	
		    КонецЕсли;
		    ТекущийИндекс = ТекущийИндекс + 1;
		КонецЦикла;

		Элементы.НалогиВзносыОтчисления.ТекущаяСтрока = ТекущийИндекс;
	ИначеЕсли ДополнительныеПараметрыНВО.Свойство("ВидДохода") Тогда
		ТекущийИндекс = 0;
		ВидДохода = ДополнительныеПараметрыНВО.ВидДохода.Наименование;
		
		Для Каждого Стр Из НалогиВзносыОтчисления Цикл
			Если Стр.ВидДохода.Наименование = ВидДохода Тогда 
		        Прервать;                                                      	
		    КонецЕсли;
		    ТекущийИндекс = ТекущийИндекс + 1;
		КонецЦикла;

		Элементы.НалогиВзносыОтчисления.ТекущаяСтрока = ТекущийИндекс;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФизическоеЛицо(СотрудникФизическоеЛицо)
	
	Если ТипЗнч(СотрудникФизическоеЛицо) = Тип("СправочникСсылка.ФизическиеЛица") Тогда 
		ФизическоеЛицо = СотрудникФизическоеЛицо;
		Возврат;
	КонецЕсли;
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникФизическоеЛицо, "ФизическоеЛицо");
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеОбязательныхПолей(ФормаЗаполненаНекорректно)
	
	Для Каждого СтрокаНалогиВзносыОтчисления Из НалогиВзносыОтчисления Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ВидДохода) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен вид дохода'"),,, "НалогиВзносыОтчисления");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ОблагаемыйДоход) 
			И НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.НеоблагаемыйДоход)
			И НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.НалогВзнос)
			И НЕ ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ОбъектИсчисления) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные'"),,, "НалогиВзносыОтчисления");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаВычетыИПН Из ВычетыИПН Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаВычетыИПН.ВидВычетаИПН) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнен вид вычета ИПН'"),,, "ВычетыИПН");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаВычетыИПН.РазрешенныйВычет) 
			И НЕ ЗначениеЗаполнено(СтрокаВычетыИПН.ПримененныйВычет) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные вычетов ИПН'"),,, "ВычетыИПН");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДоходыНеПодлежащиеНалогообложению Из ДоходыНеПодлежащиеНалогообложению Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДоходыНеПодлежащиеНалогообложению.Начисление) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено начисление, по которому не облагаются данные'"),,, "ДоходыНеПодлежащиеНалогообложению");
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаДоходыНеПодлежащиеНалогообложению.СуммаДохода) 
			И НЕ ЗначениеЗаполнено(СтрокаДоходыНеПодлежащиеНалогообложению.НеоблагаемыйДоход) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные'"),,, "ДоходыНеПодлежащиеНалогообложению");
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления");
	
	Для Каждого СтрокаКомпонентыЕП Из КомпонентыЕП Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаКомпонентыЕП.ОПВ) 
			И НЕ ЗначениеЗаполнено(СтрокаКомпонентыЕП.ВОСМС)
			И НЕ ЗначениеЗаполнено(СтрокаКомпонентыЕП.ИПН)
			И НЕ ЗначениеЗаполнено(СтрокаКомпонентыЕП.СО)
			И НЕ ЗначениеЗаполнено(СтрокаКомпонентыЕП.ООСМС)
			И НЕ ЗначениеЗаполнено(СтрокаКомпонентыЕП.ОПВР) Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнены суммовые данные'"),,, "КомпонентыЕП");
			
		КонецЕсли;
		
		СтруктураОтбора.ИдентификаторСтрокиНалогиВзносыОтчисления = СтрокаКомпонентыЕП.ИдентификаторСтрокиНалогиВзносыОтчисления;
		
		Если КомпонентыЕП.НайтиСтроки(СтруктураОтбора).Количество() > 1 Тогда
			
			ФормаЗаполненаНекорректно = Истина;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Компоненты единого платежа должны быть распределены в рамках одной строки'"),,, "КомпонентыЕП");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиИзмененияВОбъектФормыВладельца()
	
	Если Модифицированность Тогда
		Оповестить("ИзмененыРезультатыРасчетаНалогиВзносыОтчисления", ПоместитьИзмененныеДанныеВоВременноеХранилище(), ЭтаФорма);
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьИзмененныеДанныеВоВременноеХранилище()
	
	ВозвращаемыеСведения = Новый Структура;
	
	ВозвращаемыеСведения.Вставить("НалогиВзносыОтчисления", НалогиВзносыОтчисления.Выгрузить());
	ВозвращаемыеСведения.Вставить("ВычетыИПН", ВычетыИПН.Выгрузить());
	ВозвращаемыеСведения.Вставить("КомпонентыЕП", КомпонентыЕП.Выгрузить());
	ВозвращаемыеСведения.Вставить("ДоходыНеПодлежащиеНалогообложению", ДоходыНеПодлежащиеНалогообложению.Выгрузить());
	ВозвращаемыеСведения.Вставить("ФизическоеЛицо", ФизическоеЛицо);
	ВозвращаемыеСведения.Вставить("ВидНалогаВзносаОтчисления", ВидНалогаВзносаОтчисления);
	
	ИзмененныеДанные.Очистить();
	НоваяСтрока = ИзмененныеДанные.Добавить();
	НоваяСтрока.ИмяТаблицы = "НалогиВзносыОтчисления";
	НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	ВозвращаемыеСведения.Вставить("ИзмененныеДанные", ИзмененныеДанные.Выгрузить());
	
	Возврат ПоместитьВоВременноеХранилище(ВозвращаемыеСведения, Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьВычетыИПН(Форма, ИдентификаторСтрокиНалогиВзносыОтчисления)
	
	Если НЕ Форма.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ИПН") Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторСтрокиНалогиВзносыОтчисления);
	НайденныеВычетыИПН = Форма.ВычетыИПН.НайтиСтроки(Отбор);
	Для Каждого СтрокаВычетов Из НайденныеВычетыИПН Цикл
		Форма.ВычетыИПН.Удалить(СтрокаВычетов);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УдалитьКомпонентыЕП(Форма, ИдентификаторСтрокиНалогиВзносыОтчисления)
	
	Если НЕ Форма.ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторСтрокиНалогиВзносыОтчисления);
	НайденныеУдалитьКомпонентыЕП = Форма.КомпонентыЕП.НайтиСтроки(Отбор);
	Для Каждого СтрокаКомпонентыЕП Из НайденныеУдалитьКомпонентыЕП Цикл
		Форма.КомпонентыЕП.Удалить(СтрокаКомпонентыЕП);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовуюСтроку()
	
	НоваяСтрока = НалогиВзносыОтчисления.НайтиПоИдентификатору(Элементы.НалогиВзносыОтчисления.ТекущаяСтрока);
	
	НоваяСтрока.ФиксСтрока = Истина;
	НоваяСтрока.ФизическоеЛицо = ФизическоеЛицо;
	НоваяСтрока.ВидНалогаВзносаОтчисления = ВидНалогаВзносаОтчисления;
	
	Если ЗначениеЗаполнено(НоваяСтрока.ФизическоеЛицо) Тогда
		
		СтрокиНалогиВзносыОтчисления = НалогиВзносыОтчисления.НайтиСтроки(Новый Структура("ФизическоеЛицо", НоваяСтрока.ФизическоеЛицо));
		Для Каждого СтрокаНалогиВзносыОтчисления Из СтрокиНалогиВзносыОтчисления Цикл
			Если ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.Подразделение) Тогда
				НоваяСтрока.Подразделение = СтрокаНалогиВзносыОтчисления.Подразделение;
			КонецЕсли; 
			Если ЗначениеЗаполнено(СтрокаНалогиВзносыОтчисления.ВидДохода) Тогда
				НоваяСтрока.ВидДохода = СтрокаНалогиВзносыОтчисления.ВидДохода;
				Прервать;
			КонецЕсли; 
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			ДанныеПодразделения = ПодходящееПодразделение(НоваяСтрока.ФизическоеЛицо, Организация, МесяцНачисления);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеПодразделения);
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(НоваяСтрока.ВидДохода) Тогда
			НоваяСтрока.ВидДохода = Справочники.ВидыДоходов.ДоходыОтРаботодателя;
		КонецЕсли; 
		
	КонецЕсли; 
	
	НоваяСтрока.МесяцНалоговогоПериода = НачалоМесяца(МесяцНачисления);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодходящееПодразделение(ФизическоеЛицо, Организация, МесяцНачисления)
	
	Подразделение = Неопределено;
	Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Организация;
		ПараметрыПолученияСотрудников.НачалоПериода = МесяцНачисления;
		ПараметрыПолученияСотрудников.ОкончаниеПериода = КонецМесяца(МесяцНачисления);
		ПараметрыПолученияСотрудников.СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ФизическоеЛицо);
		ПараметрыПолученияСотрудников.КадровыеДанные = "Подразделение";
		
		СотрудникиОрганизации = КадровыйУчет.СотрудникиОрганизации(Истина, ПараметрыПолученияСотрудников);
		Если СотрудникиОрганизации.Количество() > 0 Тогда
			Подразделение = СотрудникиОрганизации[0].Подразделение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Подразделение", Подразделение);
	
КонецФункции

&НаСервере
Функция ПолучитьКонтролируемыеПоля() Экспорт
	
	КонтролируемыеПоля = Новый Структура("НалогиВзносыОтчисления", УчетНалоговВзносовОтчислений.КонтролируемыеПоляДляФиксацииРезультатов());
	Возврат КонтролируемыеПоля;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтарыеЗначенияКонтролируемыхПолей() Экспорт
	
	Возврат СтарыеЗначенияКонтролируемыхПолей;
	
КонецФункции

&НаСервере
Процедура ПерессчитатьИтогиЕП(ИдентификаторСтрокиНалогиВзносыОтчисления)
	
	СтрокиЕП = КомпонентыЕП.НайтиСтроки(Новый Структура("ИдентификаторСтрокиНалогиВзносыОтчисления", ИдентификаторСтрокиНалогиВзносыОтчисления));
	
	Если СтрокиЕП.Количество() > 0 Тогда
		
		Для Каждого СтрокаЕП Из СтрокиЕП Цикл
			ИтогоЗаСчетРаботника 	= СтрокаЕП.ОПВ + СтрокаЕП.ИПН + СтрокаЕП.ВОСМС;
			ИтогоЗаСчетРаботодателя = СтрокаЕП.СО + СтрокаЕП.ОПВР + СтрокаЕП.ООСМС;
		КонецЦикла;
		
	Иначе
		
		ИтогоЗаСчетРаботника 	= 0;
		ИтогоЗаСчетРаботодателя = 0;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ТабличныйДокументСправки(ДокументСсылка, Организация, ФизическоеЛицо, МесяцНачисления, ВидДохода)
	
	ДокументПроведен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Проведен");
	
	Если ДокументСсылка.Пустая()
		ИЛИ ДокументПроведен = Ложь Тогда
		ВызватьИсключение НСтр("ru='Документ не проведен, отчет не будет сформирован'");
	КонецЕсли;
	
	ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.АвтоМасштаб = Истина;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
	ДокументРезультат.ОтображатьСетку = Ложь;
	
	Попытка
		
		НачатьТранзакцию();
		
		ОтчетСправкаОРасчетахСФизическимЛицом = Отчеты.СправкаОРасчетахСФизическимЛицом.Создать();
					
		СтандартныйПериод = Новый СтандартныйПериод;
		СтандартныйПериод.ДатаНачала    = НачалоГода(МесяцНачисления);
		СтандартныйПериод.ДатаОкончания = КонецМесяца(МесяцНачисления);
		
		ПараметрыДанных = ОтчетСправкаОРасчетахСФизическимЛицом.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета", СтандартныйПериод);
		ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Организация);
		ПараметрыДанных.УстановитьЗначениеПараметра("ФизЛицо", ФизическоеЛицо);
		ПараметрыДанных.УстановитьЗначениеПараметра("ВидДохода", ВидДохода);
		
		ДопСвойства = ОтчетСправкаОРасчетахСФизическимЛицом.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
		ДопСвойства.Вставить("КлючВарианта", "СправкаОРасчетахСФизическимЛицом2026");
		
		ОтчетСправкаОРасчетахСФизическимЛицом.СкомпоноватьРезультат(ДокументРезультат);
		
		ОтменитьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли; 
		
		Инфо = ИнформацияОбОшибке();
		ВызватьИсключение НСтр("ru = 'Не удалось, сформировать отчет.'") + " " + КраткоеПредставлениеОшибки(Инфо);

	КонецПопытки;
	
	Возврат ДокументРезультат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если НЕ Модифицированность Тогда
		
		Закрыть();
		
		Возврат;
		
	КонецЕсли;
	
	ФормаЗаполненаНекорректно = Ложь;
	
	ПроверитьЗаполнениеОбязательныхПолей(ФормаЗаполненаНекорректно);
	
	Если ФормаЗаполненаНекорректно Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ВидНалогаВзносаОтчисления = ПредопределенноеЗначение("Перечисление.ВидыНалоговВзносовОтчислений.ЕП") 
		И НЕ ОтключитьВопросы Тогда 
		
		ТекстВопроса = НСтр("ru='ВАЖНО! Редактирование сумм единого платежа (компонент единого платежа) не рекомендуется. Ручные корректировки могут привести к отличиям при распределении суммы единого платежа на стороне Госкорпорации с данными учета информационной базы. Сохранить изменения?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьРедактированиеСуммДокумента", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПеренестиИзмененияВОбъектФормыВладельца();
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеСуммДокумента(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПеренестиИзмененияВОбъектФормыВладельца();
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВопросы(Команда)
	
	ОтключитьВопросы = НЕ ОтключитьВопросы;
	Элементы.НалогиВзносыОтчисленияОтключитьВопросы.Пометка = ОтключитьВопросы;
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаОРасчетахСФизическимЛицом(Команда)
	
	Если НЕ ЗначениеЗаполнено(ФизическоеЛицо)
		ИЛИ Элементы.НалогиВзносыОтчисления.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	ВидДохода = Элементы.НалогиВзносыОтчисления.ТекущиеДанные.ВидДохода;
	СправкаОРасчетахСФизическимЛицом = ТабличныйДокументСправки(ДокументСсылка, Организация, ФизическоеЛицо, МесяцНачисления, ВидДохода);
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Отчет.СправкаОРасчетахСФизическимЛицом", "СправкаОРасчетахСФизическимЛицом2026",
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументСсылка), ЭтаФорма, Новый Структура("ПечатаемыйДокумент", СправкаОРасчетахСФизическимЛицом));
		
КонецПроцедуры

#КонецОбласти

#Область Инициализация

СтарыеЗначенияКонтролируемыхПолей = Новый Соответствие;

#КонецОбласти
